#+Title: Testing CFEngine Policy
#+Author: Nick Anderson
#+Email: nick@cmdln.org
#+REVEAL_ROOT: file:///home/nickanderson/src/reveal.js/
#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1200 reveal_height:800
# The TOC is a bit much for a slide show IMHO
#+OPTIONS: toc:nil
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
# Available Transitions: default|cube|page|concave|zoom|linear|fade|none.
#+REVEAL_TRANS: fade
#+REVEAL_THEME: white 
# ?? Guess this flattens up to x levels deep
#+REVEAL_HLEVEL: 1
#+REVEAL_HEAD_PREAMBLE: <meta name=description" content=How to test cfengine policy">
#+REVEAL_POSTAMBLE: <p> Created by Nick Anderson. </p>
#+REVEAL_PLUGINS: (markdown notes)


** The most simple test

This test will fail unless the system has the =linux= class defined.

#+BEGIN_SRC cfengine3 :exports both :wrap EXAMPLE
  bundle agent main
  {
    classes:
      "pass" expression => "linux";

    reports:
      pass::
        "$(this.promise_filename) Pass";

      !pass::
        "$(this.promise_filename) FAIL";
  }
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
R: /home/nickanderson/src/presentations/testing-cfengine-policy/cfengine3-16585LMB Pass
#+END_EXAMPLE

